## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_user_assigned_identity.uami-audit-logs will be created
  + resource "azurerm_user_assigned_identity" "uami-audit-logs" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "uami-nc-log-dev-ne-001"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-aztf-logging-prod-ne-01"
      + tenant_id           = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>